ch8/ch8-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-09 Sun 07:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 8.1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 8.1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3623b6f">ch8.1</a>
<ul>
<li><a href="#orgc6a6a10">8.1-1</a></li>
<li><a href="#org879bc9b">8.1-2</a></li>
<li><a href="#org1ea2d5b">8.1-3</a></li>
<li><a href="#org951e863">8.1-4</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3623b6f" class="outline-2">
<h2 id="org3623b6f">ch8.1</h2>
<div class="outline-text-2" id="text-org3623b6f">
</div>
<div id="outline-container-orgc6a6a10" class="outline-3">
<h3 id="orgc6a6a10">8.1-1</h3>
<div class="outline-text-3" id="text-orgc6a6a10">
<p>
Consider a graph \(G = (V, E)\), which \(V\) represents the set of all \(n\)
elements, and \(E\) represents the set of all comparison, then we know that
the graph \(G\) should be connected for a comparison sort, at least \(n - 1\)
edges is needed, thus the smallest possible depth of a leaf in a decision
tree for a comparison sort is \(n - 1\).
</p>

<p>
For example, we do comparisons between \(a_i\) and \(a_{i+1}\)
for \(i \in [1, n - 1]\),
when \(a_1 \leq a_2 \leq a_3 \leq ... \leq a_{n-1} \leq a_n\).
</p>
</div>
</div>
<div id="outline-container-org879bc9b" class="outline-3">
<h3 id="org879bc9b">8.1-2</h3>
<div class="outline-text-3" id="text-org879bc9b">
<p>
Since \(\lg k\) is monotonically increasing, we can approximate the summation
use the formula \(A.11\).
</p>
\begin{align*}
\int_{0}^{n}\lg(x)dx
\leq \sum_{k=1}^{n}\lg k
\leq \int_{1}^{n+1}\lg(x)dx
\end{align*}
<p>
Evaluate the integral, we have
</p>
\begin{align*}
\frac{n(\lg n-1)}{\ln 2}
\leq \sum_{k=1}^{n}\lg k
\leq \frac{(n+1)(\lg(n+1)-1)}{\ln 2}
\end{align*}
<p>
From the inequation, we obtain the asymptotically tight bounds
\(\Theta(n\lg n)\).
</p>
</div>
</div>
<div id="outline-container-org1ea2d5b" class="outline-3">
<h3 id="org1ea2d5b">8.1-3</h3>
<div class="outline-text-3" id="text-org1ea2d5b">
<p>
Assume the running time is at most \(cn\), we know that there are at most
\(2^{cn+1}\) leaves under depth \(cn\).
</p>

<p>
Since \(2^{cn+1} = o(\frac{1}{2}n!)\), there is no comparison sort whose
running time is linear for at least half of the \(n!\) inputs of length
\(n\).
</p>

<p>
Since \(2^{cn+1} = o(\frac{1}{n}n!)\), there is no comparison sort whose
running time is linear for at a fraction of \(1/n\) of the \(n!\) inputs of
length \(n\).
</p>

<p>
Since \(2^{cn+1} = o(\frac{1}{2^n}n!)\), there is no comparison sort whose
running time is linear for at a fraction of \(1/2^n\) of the \(n!\) inputs of
length \(n\).
</p>
</div>
</div>
<div id="outline-container-org951e863" class="outline-3">
<h3 id="org951e863">8.1-4</h3>
<div class="outline-text-3" id="text-org951e863">
<p>
Build a decision tree to represent a comparison sort of the given problem,
assume the number of leaves is \(l\) and the height of the tree is \(h\),
we know that
</p>
\begin{align*}
(k!)^{\frac{n}{k}} \leq l \leq 2^h
\end{align*}
<p>
Take logarithms on the inequation, we have
</p>
\begin{align*}
h
&\geq \frac{n}{k}\lg(k!)\\
&=\Omega(n\lg k)
\end{align*}
<p>
Thus the lower bound of the number of comparisons is \(\Omega(n\lg k)\).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2022-10-09 Sun 07:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
